Revit 2027 API
IndependentTag.IsOrphaned Property
 Identifies if the tag is orphaned or not.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsOrphaned { get; }
Public ReadOnly Property IsOrphaned As Boolean
	Get
public:
property bool IsOrphaned {
	bool get ();
}
member IsOrphaned : bool with get
Property Value
Boolean
Remarks
 Orphaned tags are those tags that are associated with one or more linked host that is missing. Tags become orphaned when one or more associated linked host is missing from the link.
See Also
Reference
IndependentTag Class
Autodesk.Revit.DB Namespace